InformationRegisters/ИсполнителиГрупповогоЭтапа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсполнителиГрупповогоЭтапа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныйОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаПоОбработкеДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметПроцессаОбработкиДокументов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭтапа</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерИтерации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СобытияИсторииЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СобытияИсторииЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКИсполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаПринятияКИсполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначениеИсполнителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаНазначенияИсполнителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВыполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеуспешнаяПопыткаВыполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прерывание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНаРольИсполнителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеПрерванной</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ХодВыполненияГрупповогоЭтапа/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Заголовок = Параметры.НаименованиеЭтапа;
	
	Документ = Параметры.Документ;
	ИдентификаторЭтапа = Параметры.ИдентификаторЭтапа;
	
	// Определение актуального номер итерации
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИсполнителиГрупповогоЭтапа.Задача КАК Задача,
	|	ИсполнителиГрупповогоЭтапа.НомерИтерации КАК НомерИтерации
	|ИЗ
	|	РегистрСведений.ИсполнителиГрупповогоЭтапа КАК ИсполнителиГрупповогоЭтапа
	|ГДЕ
	|	ИсполнителиГрупповогоЭтапа.Предмет = &Предмет
	|	И ИсполнителиГрупповогоЭтапа.ИдентификаторЭтапа = &ИдентификаторЭтапа
	|	И ИсполнителиГрупповогоЭтапа.Задача <> ЗНАЧЕНИЕ(Задача.ЗадачаПоОбработкеДокумента.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИсполнителиГрупповогоЭтапа.Задача.Выполнена,
	|	ИсполнителиГрупповогоЭтапа.Задача.ДатаИсполнения УБЫВ";
	
	Запрос.УстановитьПараметр("Предмет", Документ);
	Запрос.УстановитьПараметр("ИдентификаторЭтапа", ИдентификаторЭтапа);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		ОбразецЗадачи = Выборка.Задача;
		НомерИтерации = Выборка.НомерИтерации;
	Иначе
		ТекстСообщения = НСтр("ru='Не удалось определить актуальный номер итерации группового этапа'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	ОбновитьСписокЗадач();
	
	// Кнопки запуска и прерывания должны быть доступны только куратору
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТекущиеНевыполненныеЗадачи.Ссылка КАК Ссылка
	|ИЗ
	|	Задача.ЗадачаПоОбработкеДокумента.ЗадачиПоИсполнителю(
	|			,
	|			Предмет = &Предмет
	|				И НЕ Выполнена) КАК ТекущиеНевыполненныеЗадачи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШаблоныПроцессов.Этапы КАК ШаблоныПроцессовЭтапы
	|		ПО (ШаблоныПроцессовЭтапы.Ссылка = ТекущиеНевыполненныеЗадачи.Шаблон)
	|			И (ШаблоныПроцессовЭтапы.ИдентификаторЭтапаКуратора = ТекущиеНевыполненныеЗадачи.ИдентификаторЭтапа)";
	
	Запрос.УстановитьПараметр("Предмет", Документ);
	
	ЭтоКуратор = НЕ Запрос.Выполнить().Пустой();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СоздатьЗадачу", "Видимость", ЭтоКуратор);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ПрерватьЗадачу", "Видимость", ЭтоКуратор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_ЗадачаПоОбработкеДокумента" Тогда
		ЗапомнитьТекущегоИсполнителя();
		ОбновитьСписокЗадач();
		УправлениеДоступностьюКоманд(Элементы.Исполнители.ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьЗадачу(Команда)
	
	СоздатьЗадачиКлиент(Элементы.Исполнители.ВыделенныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрерватьЗадачу(Команда)
	
	ПрерватьЗадачиКлиент(Элементы.Исполнители.ВыделенныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИсполнителей(Команда)
	ЗапомнитьТекущегоИсполнителя();
	ОбновитьСписокЗадач();
	УправлениеДоступностьюКоманд(Элементы.Исполнители.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Исполнители

&НаКлиенте
Процедура ИсполнителиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ИсполнителиПриАктивизацииСтроки(Элемент)
	УправлениеДоступностьюКоманд(Элемент.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеДоступностьюКоманд(ТекущиеДанные)
	
	Если НЕ ЭтоКуратор Тогда
		Возврат;
	КонецЕсли;
	
	ПустаяСсылка = ПредопределенноеЗначение("Задача.ЗадачаПоОбработкеДокумента.ПустаяСсылка");
	
	Если ТекущиеДанные = Неопределено Тогда
		Элементы.СоздатьЗадачу.Доступность = Ложь;
		Элементы.ПрерватьЗадачу.Доступность = Ложь;
	ИначеЕсли ТекущиеДанные.ЗадачаПрервана Тогда // прервана
		Элементы.СоздатьЗадачу.Доступность = Истина;
		Элементы.ПрерватьЗадачу.Доступность = Ложь;
	ИначеЕсли ТекущиеДанные.ЗадачаВыполнена Тогда // выполнена
		Элементы.СоздатьЗадачу.Доступность = Ложь;
		Элементы.ПрерватьЗадачу.Доступность = Ложь;
	ИначеЕсли ТекущиеДанные.ЗадачаСсылка = ПустаяСсылка Тогда // нет задачи
		Элементы.СоздатьЗадачу.Доступность = Истина;
		Элементы.ПрерватьЗадачу.Доступность = Ложь;
	Иначе // активна
		Элементы.СоздатьЗадачу.Доступность = Ложь;
		Элементы.ПрерватьЗадачу.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗадачиКлиент(ВыделенныеСтроки)
	
	ЗадачиДляЗапуска = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		
		Если ТипЗнч(ВыделеннаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Продолжить;
		КонецЕсли;
		
		ЗадачаДляЗапуска = Новый Структура("ЗадачаСсылка, ЗадачаВыполнена, ЗадачаПрервана,
			|Исполнитель, РольИсполнителя, ОсновнойОбъектАдресации, ДополнительныйОбъектАдресации,
			|Предмет, ИдентификаторЭтапа, НомерИтерации, ПорядковыйНомер");
		
		ЗаполнитьЗначенияСвойств(ЗадачаДляЗапуска, Элементы.Исполнители.ДанныеСтроки(ВыделеннаяСтрока));
		
		ЗадачиДляЗапуска.Добавить(ЗадачаДляЗапуска);
		
	КонецЦикла;
	
	СоздатьЗадачи(ЗадачиДляЗапуска);
	
	Если ЗадачиДляЗапуска.Количество() > 0 Тогда
		Оповестить("Запись_ЗадачаПоОбработкеДокумента");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗадачи(ЗадачиДляЗапуска)
	
	СозданныеЗадачи = Новый Массив;
	ВосстановленныеЗадачи = Новый Массив;
	
	ПустаяСсылка = ПредопределенноеЗначение("Задача.ЗадачаПоОбработкеДокумента.ПустаяСсылка");
	
	Для Каждого ЗадачаДляЗапуска Из ЗадачиДляЗапуска Цикл
		
		Если ЗадачаДляЗапуска.ЗадачаСсылка = ПустаяСсылка Тогда
			
			// создание задачи
			// задачу необходимо создать с реквизитами, аналогичными тем, что есть у задач этого же группового этапа
			
			Образец = ОбразецЗадачи.ПолучитьОбъект();
			
			ПараметрыЗадачи = ПроцессыОбработкиДокументов.ПараметрыСозданияЗадачи();
			ПараметрыЗадачи.Шаблон = Образец.Шаблон;
			ПараметрыЗадачи.Этап = Образец.Этап;
			ПараметрыЗадачи.ИдентификаторЭтапа = Образец.ИдентификаторЭтапа;
			ПараметрыЗадачи.НаименованиеЭтапа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Образец.Этап, "Наименование");
			ПараметрыЗадачи.Статус = Образец.Статус;
			ПараметрыЗадачи.Документ = Образец.Предмет;
			ПараметрыЗадачи.Описание = Образец.Описание;
			ПараметрыЗадачи.РезультатВыполнения = "";
			ПараметрыЗадачи.Исполнитель = ЗадачаДляЗапуска.Исполнитель;
			ПараметрыЗадачи.РольИсполнителя = ЗадачаДляЗапуска.РольИсполнителя;
			ПараметрыЗадачи.ОсновнойОбъектАдресации = ЗадачаДляЗапуска.ОсновнойОбъектАдресации;
			ПараметрыЗадачи.ДополнительныйОбъектАдресации = ЗадачаДляЗапуска.ДополнительныйОбъектАдресации;
			ПараметрыЗадачи.ПринятаКИсполнению = Ложь;
			ПараметрыЗадачи.Предшественники = Образец.Предшественники.ВыгрузитьКолонку("ЗадачаПредшественник");
			ПараметрыЗадачи.СрокВыполненияЧасы = Образец.СрокВыполненияЧасы;
			
			ПроцессыОбработкиДокументов.СоздатьЗадачу(ПараметрыЗадачи);
			
			// добавление ссылки на созданную задачу в регистр сведений
			Запись = РегистрыСведений.ИсполнителиГрупповогоЭтапа.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, ЗадачаДляЗапуска);
			Запись.Задача = ПараметрыЗадачи.Задача;
			
			УстановитьПривилегированныйРежим(Истина);
			Запись.Записать();
			УстановитьПривилегированныйРежим(Ложь);
			
		ИначеЕсли ЗадачаДляЗапуска.ЗадачаПрервана Тогда
			
			НачатьТранзакцию();
			Попытка
				
				ПроцессыОбработкиДокументов.ПроверитьИЗаблокироватьЗадачиОтВыполнения(ЗадачаДляЗапуска.ЗадачаСсылка);
			
				ПроцессыОбработкиДокументов.ЗаблокироватьЗадачи(ЗадачаДляЗапуска.ЗадачаСсылка);
				
				// восстановление задачи
				УстановитьПривилегированныйРежим(Истина);
				
				ЗадачаОбъектДляВосстановления = ЗадачаДляЗапуска.ЗадачаСсылка.ПолучитьОбъект();
				ЗадачаОбъектДляВосстановления.Заблокировать();
				ЗадачаОбъектДляВосстановления.Выполнена = Ложь;
				ЗадачаОбъектДляВосстановления.Прервана = Ложь;
				ЗадачаОбъектДляВосстановления.Записать();
				
				УстановитьПривилегированныйРежим(Ложь);
				
				ПроцессыОбработкиДокументовПереопределяемый.ПриВыполненииЗадачи(ЗадачаДляЗапуска.ЗадачаСсылка);
				
				ВосстановленныеЗадачи.Добавить(ЗадачаДляЗапуска.ЗадачаСсылка);
				
				ЗафиксироватьТранзакцию();
			Исключение
				
				ОтменитьТранзакцию();
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Восстановление прерванной задачи по обработке документа'", ОбщегоНазначения.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Ошибка,,,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПроцессыОбработкиДокументов.СохранитьСобытиеИсторииЗадач(
		ВосстановленныеЗадачи, ПредопределенноеЗначение("Перечисление.СобытияИсторииЗадач.ВосстановлениеПрерванной"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПрерватьЗадачиКлиент(ВыделенныеСтроки)
	
	ЗадачиДляПрерывания = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		
		Если ТипЗнч(ВыделеннаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Продолжить;
		КонецЕсли;
		
		ЗадачаДляПрерывания = Новый Структура("ЗадачаСсылка, ЗадачаВыполнена");
		
		ЗаполнитьЗначенияСвойств(ЗадачаДляПрерывания, Элементы.Исполнители.ДанныеСтроки(ВыделеннаяСтрока));
		
		ЗадачиДляПрерывания.Добавить(ЗадачаДляПрерывания);
		
	КонецЦикла;
	
	ПрерватьЗадачи(ЗадачиДляПрерывания);
	
	Если ЗадачиДляПрерывания.Количество() > 0 Тогда
		Оповестить("Запись_ЗадачаПоОбработкеДокумента");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрерватьЗадачи(ЗадачиДляПрерывания)
	
	ПустаяСсылка = ПредопределенноеЗначение("Задача.ЗадачаПоОбработкеДокумента.ПустаяСсылка");
	
	ПрерванныеЗадачи = Новый Массив;
	
	Для Каждого ЗадачаДляПрерывания Из ЗадачиДляПрерывания Цикл
		
		Если ЗадачаДляПрерывания.ЗадачаВыполнена Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗадачаДляПрерывания.ЗадачаСсылка = ПустаяСсылка Тогда
			Продолжить;
		КонецЕсли;
		
		НачатьТранзакцию();
		Попытка
			
			ПроцессыОбработкиДокументов.ПроверитьИЗаблокироватьЗадачиОтВыполнения(ЗадачаДляПрерывания.ЗадачаСсылка);
			
			ПроцессыОбработкиДокументов.ЗаблокироватьЗадачи(ЗадачаДляПрерывания.ЗадачаСсылка);
			
			УстановитьПривилегированныйРежим(Истина);
			ПроцессыОбработкиДокументов.ВыполнитьЗадачуПользователя(ЗадачаДляПрерывания.ЗадачаСсылка, Истина);
			УстановитьПривилегированныйРежим(Ложь);
			
			ПроцессыОбработкиДокументовПереопределяемый.ПриВыполненииЗадачи(ЗадачаДляПрерывания.ЗадачаСсылка);
			
			ПрерванныеЗадачи.Добавить(ЗадачаДляПрерывания.ЗадачаСсылка);
			
			ЗафиксироватьТранзакцию();
		Исключение
			
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Прерывание задачи по обработке документа'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
	
	ПроцессыОбработкиДокументов.СохранитьСобытиеИсторииЗадач(
		ПрерванныеЗадачи, ПредопределенноеЗначение("Перечисление.СобытияИсторииЗадач.Прерывание"));
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокЗадач()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрСведенийИсполнителиГрупповогоЭтапа.Предмет КАК Предмет,
	|	РегистрСведенийИсполнителиГрупповогоЭтапа.ИдентификаторЭтапа КАК ИдентификаторЭтапа,
	|	РегистрСведенийИсполнителиГрупповогоЭтапа.НомерИтерации КАК НомерИтерации,
	|	РегистрСведенийИсполнителиГрупповогоЭтапа.ПорядковыйНомер КАК ПорядковыйНомер,
	|	РегистрСведенийИсполнителиГрупповогоЭтапа.Исполнитель КАК Исполнитель,
	|	РегистрСведенийИсполнителиГрупповогоЭтапа.РольИсполнителя КАК РольИсполнителя,
	|	РегистрСведенийИсполнителиГрупповогоЭтапа.ОсновнойОбъектАдресации КАК ОсновнойОбъектАдресации,
	|	РегистрСведенийИсполнителиГрупповогоЭтапа.ДополнительныйОбъектАдресации КАК ДополнительныйОбъектАдресации,
	|	РегистрСведенийИсполнителиГрупповогоЭтапа.Задача КАК ЗадачаСсылка,
	|	ВЫБОР
	|		КОГДА РегистрСведенийИсполнителиГрупповогоЭтапа.Задача = ЗНАЧЕНИЕ(Задача.ЗадачаПоОбработкеДокумента.ПустаяСсылка)
	|			ТОГДА ""Нет задачи""
	|		КОГДА РегистрСведенийИсполнителиГрупповогоЭтапа.Задача.Прервана
	|			ТОГДА ""Прервана""
	|		КОГДА РегистрСведенийИсполнителиГрупповогоЭтапа.Задача.Выполнена
	|			ТОГДА ""Выполнена""
	|		ИНАЧЕ ""Активна""
	|	КОНЕЦ КАК Задача,
	|	РегистрСведенийИсполнителиГрупповогоЭтапа.Задача.Выполнена КАК ЗадачаВыполнена,
	|	РегистрСведенийИсполнителиГрупповогоЭтапа.Задача.Прервана КАК ЗадачаПрервана
	|ИЗ
	|	РегистрСведений.ИсполнителиГрупповогоЭтапа КАК РегистрСведенийИсполнителиГрупповогоЭтапа
	|ГДЕ
	|	РегистрСведенийИсполнителиГрупповогоЭтапа.Предмет = &Предмет
	|	И РегистрСведенийИсполнителиГрупповогоЭтапа.ИдентификаторЭтапа = &ИдентификаторЭтапа
	|	И РегистрСведенийИсполнителиГрупповогоЭтапа.НомерИтерации = &НомерИтерации
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядковыйНомер";
	
	Запрос.УстановитьПараметр("Предмет", Документ);
	Запрос.УстановитьПараметр("ИдентификаторЭтапа", ИдентификаторЭтапа);
	Запрос.УстановитьПараметр("НомерИтерации", НомерИтерации);
	
	УстановитьПривилегированныйРежим(Истина);
	Исполнители.Загрузить(Запрос.Выполнить().Выгрузить());
	УстановитьПривилегированныйРежим(Ложь);
	
	УстановитьТекущегоИсполнителя();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапомнитьТекущегоИсполнителя()
	
	ТекущиеДанные = Элементы.Исполнители.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ТекущийИсполнитель = Неопределено;
	Иначе
		ТекущийИсполнитель = ТекущиеДанные.Исполнитель;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущегоИсполнителя()
	
	Если НЕ ЗначениеЗаполнено(ТекущийИсполнитель) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Исполнитель Из Исполнители Цикл
		Если Исполнитель.Исполнитель = ТекущийИсполнитель Тогда
			Элементы.Исполнители.ТекущаяСтрока = Исполнитель.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
